# Словарь соответствия ID подразделения (из настроек SEARCH_LPU_BUILDING_CIDS)
# и адреса, который нужно выбрать в выпадающем списке ГИС ОМС.

division_addresses = {
    # "ID_из_ЕВМИАС": "Точная строка адреса из справочника ГИС ОМС"
    "3010101000000467": "Павлика Морозова, д. 6",
    "3010101000000471": "г. Оленегорск -2",
    "3010101000000469": "Володарского, д. 2/12",
}

division_names = {
    "3010101000000467": "Стационар",
    "3010101000000471": "Оленегорская больница",
    "3010101000000469": "Отделение ВРТ (поликлиника)"
}

division_structure_names = {
    "3010101000000467": "Стационар",
    "3010101000000471": "Стационар",
    "3010101000000469": "Поликлиника"
}

# Адрес по умолчанию (на случай, если ID не найден в маппере)
DEFAULT_DIVISION_ADDRESS = "Павлика Морозова, д. 6"
DEFAULT_DIVISION_NAME = "Неизвестное подразделение"
DEFAULT_DIVISION_STRUCTURE_NAME = "Стационар"